app/views/customers/index.html.erb

SELECT "customers".* FROM "customers"
---
  <% end %>
  <% if (!(@customers == Customer.all)) %>