app/controllers/customer_contacts_controller.rb

  def new
    @insure_trad_supp = InsureTradSupp.find(params[:insure_trad_supp_id])
---
SELECT  "insure_trad_supps".* FROM "insure_trad_supps" WHERE "insure_trad_supps"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @insure_trad_supp = InsureTradSupp.find(params[:insure_trad_supp_id])
    @customer_contact = CustomerContact.new(customers_contact_params)
    @customer_contact.insure_trad_supp = @insure_trad_supp
    if @customer_contact.save
---
SELECT  "insure_trad_supps".* FROM "insure_trad_supps" WHERE "insure_trad_supps"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "customer_contacts" ("last_name_contact", "last_name_dirigeant", "last_name_correspondance", "position_contact", "position_dirigeant", "position_correspondance", "email_dirigeant", "email_contact", "email_correspondance", "tel_contact", "tel_dirigeant", "tel_correspondance", "insure_trad_supp_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15) RETURNING "id"