app/models/option.rb

  def credit_risk_environnement
    country_weight = 0.2
    zip_code_weight = 0.2
    industry_weight = 0.6
    zip_code = self.insure_trad_supp.contract.customer.zip_code.to_s
    country = self.insure_trad_supp.contract.customer.country.capitalize
---
SELECT  "contracts".* FROM "contracts" WHERE "contracts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "customers".* FROM "customers" WHERE "customers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]