app/views/insure_trad_supps/creationpdf.html.erb

SELECT  "contracts".* FROM "contracts" WHERE "contracts"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]
SELECT  "customers".* FROM "customers" WHERE "customers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
          <td>Pays</td>
          <td><%= @insure_trad_supp.contract.customer.country %></td>